var Application = {
  GeneralInformation: {
    about_page : "\n                            <p>\n                                Пласт – українська скаутська організація. <a href=\"http://www.plast.org.ua/about/goal/\">Метою Пласту</a> є сприяти всебічному, патріотичному вихованню та самовихованню української молоді на засадах християнської моралі. Будучи неполітичною і позаконфесійною організацією, Пласт виховує молодь на свідомих, відповідальних і повновартісних громадян місцевої, національної та світової спільноти, провідників суспільства.\n                            </p>\n                            <p>\n                                Пласт <a href=\"http://www.plast.org.ua/history/\">був створений</a> у 1911 році, невдовзі після заснування скаутського руху Робертом Бейден-Пауелом в 1907 р., а вже 12 квітня 1912 року у Львові пластуни склали першу Пластову присягу. Серед засновників організації були д-р. Олександр Тисовський, Петро Франко (син Івана Франка) та Іван Чмола. В основі назви \"Пласт\" лежить відповідник англійського Scout (розвідник), взятий за прикладом пластунів - козаків-розвідників.\n                            </p>\n                            <div style=\"float: right\">\n                                <img alt=\"Герб Пласту - тризуб, переплетений із трилистою лілеєю\" src=\"http://www.plast.org.ua/images/site/lelia.gif\" border=\"0\" height=\"180\" vspace=\"5\" width=\"142\"><br>\n                                <div style=\"text-align: center;\">\n                                    <span style=\"font-weight: bold;\">Герб Пласту</span>\n                                </div>\n                            </div>\n                            <p>\n                                <a href=\"http://www.plast.org.ua/about/ideology/emblem/\">Гербом Пласту</a> є трилиста квітка лілії - символ скаутського руху (відомий як Fleur-de-lis) - та тризуб, сплетені в одну гармонійну цілісність.\n                            </p>\n                            <p>\n                                Для досягнення виховних цілей Пласт застосовує <a href=\"http://www.plast.org.ua/about/method/method/\">власну унікальну методу виховання</a>, основні принципи якої полягають у добровільності членства в організації, вихованні і навчанні через гру та працю, поступовій програмі занять і випробувань, гуртковій системі самоорганізації, заохоченні ініціативи і самоврядування, пізнанні природи і житті серед природи, підтримці спеціальних зацікавлень і здібностей дітей та молоді.\n                            </p>\n                            <p>\n                                На відміну від більшості скаутських організацій світу, де членство завершується із досягненням 25-ліття, членство в Пласті є пожиттєвим. Умовний віковий поділ передбачає <a href=\"http://www.plast.org.ua/about/method/agegroups/\">4 вікові категорії</a>: новаки (6-12 років), юнаки (12-18 років), старші пластуни (18-35 років) та пластуні-сеніори (від 35 років). Виховна та адміністративна праця в Пласті здійснюється старшими пластунами та пластунами-сеніорами виключно на волонтерських засадах.\n                            </p>\n                            <p>\n                                Пласт в Україні об'єднує близько 6 тисяч членів різного віку і таким чином є найбільшою скаутською організацією України. На сьогодні 121 осередок Пласту діє у 22 областях України, Автономній республіці Крим, Києві і Севастополі. Пласт активно співпрацює з органами державної влади та громадськими організаціями, реалізуючи різноманітні соціальні та виховні програми.\n                            </p>\n                            <p>\n                                Протягом року Пласт в Україні проводить понад 100 виховних таборів різної спеціалізації: спортивні, морські, з повітроплавання, мистецькі, лижні, альпіністичні, археологічні, кінні, екологічні тощо. У таборах пластуни практично закріплюють знання і уміння, здобуті впродовж року на щотижневих заняттях. Серед найбільших заходів, котрі щороку проводяться Пластом на всеукраїнському рівні - інтелектуально-мистецький змаг Орликіада, фестиваль творчості День пластуна, спортивний змаг Спартакіада, <a href=\"http://www.vvm.plast.org.ua\">передача Вифлеємського вогню</a> місцевим громадам, змагання з пішого мандрівництва \"Стежками героїв\" та \"Осінній рейд\". На місцевому рівні осередками Пласту постійно реалізується безліч акцій соціально-культурного та виховного спрямування.\n                            </p>\n                            <p>\n                                Окрім України, Пласт офіційно існує у восьми країнах світу: Австралії, Аргентині, Великобританії, Канаді, Німеччині, Польщі, Словаччині та США. Пластові організації із усіх дев'яти країн об'єднані в <a href=\"http://www.plastscouting.org/\">Конференцію українських пластових організацій</a>, на чолі світового пластового руху стоїть <a href=\"http://www.plast.org.ua/history/nachalni/info/\">Начальний пластун</a>.\n                            </p>\n                        " 
  },
  Users: [

                  {id:1,
                  username: 'Tolik',
                  firstName: 'Данило',
                  lastName: 'fdghfgdjj',
                  group: '',
                  role_id: 1,
                  location: "Ukraine",
                  email: "abrasklyushta@gmail.com",
                  password: "4321",
                  re_passwd: "4321",
                  birthday: "28-12-1990",
                  statusname: '',
                  org_level: '',

                  org_troop: "some troop",
                  org_region: "Івано-Франківськ",
                  org_group: "some group",
                  banned: 1, // чорний список юзерів: 0 - незабанений. 1 - забанений.
                  login_status: 0
                  },
                  {id:2,
                  username: 'Vasyl',
                  firstName: 'Вадим',
                  lastName: 'fdghfgdjj',
                  group: '',
                  role_id: 2,
                  location: "Ukraine",
                  email: "darasklyushta@gmail.com",
                  password: "4321",
                  re_passwd: "4321",
                  birthday: "28-12-2001",
                  statusname: '',
                  org_level: '',
                  org_troop: "some troop",
                  org_region: "Івано-Франківськ",
                  org_group: "some group",
                  banned: 0, // чорний список юзерів: 0 - незабанений. 1 - забанений.
                  login_status: 0

                    
                  },
                  {id:3,
                  username: 'Valera',
                  firstName: 'Богдан',
                  lastName: 'sdfdgg',
                  group: '',
                  role_id: 3,
                  location: "Ukraine",
                  email: "carasklyushta@gmail.com",
                  password: "1234",
                  re_passwd: "1234",
                  birthday: "28-12-1998",
                  statusname: '',
                  org_level: '',
                  org_troop: "some troop",
                  org_region: "Івано-Франківськ",
                  org_group: "some group",
                  banned: 0, // чорний список юзерів: 0 - незабанений. 1 - забанений.
                  login_status: 0
                    
                  },
                  {id:4,
                  username: 'Vova',
                  firstName: 'Аня',
                  lastName: 'fgsjgjgj',
                  group: '',
                  role_id: 1,
                  location: "Ukraine",
                  email: "aarasklyushta@gmail.com",
                  password: "1234",
                  re_passwd: "1234",
                  birthday: "28-12-1984",
                  statusname: '',
                  org_level: '',
                  org_troop: "some troop",
                  org_region: "Івано-Франківськ",
                  org_group: "some group",
                  banned: 0, // чорний список юзерів: 0 - незабанений. 1 - забанений.
                  login_status: 0
                    
                  }
                                

      ],
  Tests: [
         {id: 1,
          user_owner_id: 1,
          name: "Правила дорожнього руху1",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег44', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'ffgfggffgМають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: '554g455Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 4,

          //category: 1,
          date: 1401211224657,

          category: 1,
          passed_date: [1391431224657]
               //   passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 

         },
         {id: 2,
          user_owner_id: 3,
          name: "Highway code",
          author: "John Dou",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег43', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: '!!!!!!!!!!!!!!!!!!!!!Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: '$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 11,

          //category: 1,
          date: 1401231224657,

          category: 3,
        // passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
          passed_date: [1301431224657,1390718456676,1499031224657]
         },

         {id: 4,
          user_owner_id: 1,
          name: "Правила дорожнього руху2",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?',
                  question_description: 'Опис питання 1'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?',
                  question_description: 'Опис питання 2'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні',
                  question_description: 'Опис питання 3'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 7,

          //category: 1,
          date: 1401211224657,

          category: 2,
        // passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
          passed_date: [1401818456676]
         },

         {id: 6,
          user_owner_id: 1,
          name: "Правила дорожнього руху3",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
         {id: 9,
          user_owner_id: 1,
          name: "Правила дорожнього руху4",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 17,
          user_owner_id: 1,
          name: "Правила дорожнього руху5",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 10,
          user_owner_id: 1,
          name: "Правила дорожнього руху6",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 14,
          user_owner_id: 1,
          name: "Правила дорожнього руху7",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 11,
          user_owner_id: 1,
          name: "Правила дорожнього руху8",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 16,
          user_owner_id: 1,
          name: "Правила дорожнього руху9",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 12,
          user_owner_id: 1,
          name: "Правила дорожнього руху10",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 15,
          user_owner_id: 1,
          name: "Правила дорожнього руху11",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 8,
          user_owner_id: 1,
          name: "Правила дорожнього руху12",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      {id: 13,
          user_owner_id: 1,
          name: "Правила дорожнього руху13",
          author: "Tolik",
          description: "Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!",
          tags: ['зупинитися', 'тег453', 'тег3', 'тег5', 'тег2'],
          question: [
                {
                  id: 1,
                  text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
                }, 
                {
                  id: 2,
                  text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
                },
                {
                  id: 3,
                  text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
                }
              ],
          answers: [
                {
                  id: 1,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                }, 
                {
                  id: 2,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 3,
                  question_id: 1,
                  text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
                },
                {
                  id: 4,
                  question_id: 2,
                  text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
                }, 
                {
                  id: 5,
                  question_id: 2,
                  text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
                },
                {
                  id: 6,
                  question_id: 2,
                  text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
                },
                {
                  id: 7,
                  question_id: 3,
                  text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
                },
                {
                  id: 8,
                  question_id: 3,
                  text_answer: 'Проїхати пішохідний перехід беззупинно.'
                },
                {
                  id: 9,
                  question_id: 3,
                  text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
                }
              ],
          correct_answer: [
                  {
                    question_id: 1,
                    answer_id: 2
                  },
                  {
                    question_id: 2,
                    answer_id: 5
                  },
                  {
                    question_id: 3,
                    answer_id: 7
                  }
                  ],
          info: ['info1', 'info2'],
          status: {
              id:3,
              name_status: "опублікований"
              },
          subcategory: 5,

          //category: 1,
          date: 1401211224657,

          category: 1,
                  //passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361] 
                  passed_date:[1401818456676]
         },
      
      ],
  Tests_categories: [
            {
              id: 1,
              name: "Спорт",
              parent_id: 0,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Application.Tests_categories.length ; i++ ) {
                                    if ( Application.Tests_categories[i].parent_id === id) {
                                        result.push(Application.Tests_categories[i]);
                                    };
                                };
                                return result;
                            }
            },
            {
              id: 2,
              name: "Туризм",
              parent_id: 0,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Application.Tests_categories.length ; i++ ) {
                                    if ( Application.Tests_categories[i].parent_id === id) {
                                        result.push(Application.Tests_categories[i]);
                                    };
                                };
                                return result;
                            }
            },
            {
              id: 3,
              name: "Комп'ютери",
              parent_id: 0,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Application.Tests_categories.length ; i++ ) {
                                    if ( Application.Tests_categories[i].parent_id === id) {
                                        result.push(Application.Tests_categories[i]);
                                    };
                                };
                                return result;
                            }
            },
            {
              id: 4,
              name: "Футбол",
              parent_id:1,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 5,
              name: "Хокей",
              parent_id:1,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 6,
              name: "Баскетбол",
              parent_id:1,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 7,
              name: "Країни",
              parent_id:2,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 8,
              name: "підкатегорія",
              parent_id:2,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            }
            },
            {
              id: 9,
              name: "підкатегорія",
              parent_id:2,
                             getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 10,
              name: "підкатегорія",
              parent_id:3,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 11,
              name: "підкатегорія",
              parent_id:3,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            },
            {
              id: 12,
              name: "підкатегорія",
              parent_id:3,
                            getSubcategories: function(id) {
                                var result = [];
                                for ( var i = 0 ; i < Categories.length ; i++ ) {
                                    if ( Categories[i].parent_id === id) {
                                        result.push(Categories[i]);
                                    };
                                };
                                return result;
                            } 
            } 

          ],

    

 Result: [
    {   id: 1,
        u_id : 1,
        name : 'Test Name1',
        test_id: 1,
        passed_date: 1391431224657,
        score : 68,
        user_rank: 1

    },
    {   id: 2,
        u_id : 3,
        name : 'Test Name2',
        test_id: 2,
        passed_date: 1301431224657, 
        score : 75,
        user_rank: 2

    },
    {   id: 3,
        u_id : 2,
        name : 'Test Name2',
        test_id: 2,
        passed_date:1390718456676,
        score : 50,
        user_rank: 2

    },
    {   id: 4,
        u_id : 2,
        name : 'Test Name2',
        test_id: 2,
        passed_date:1499031224657,
        score : 90,
        user_rank: 1

    },
    {   id: 5,
        u_id : 4,
        test_id: 6,
        name : 'Test Name6',
        passed_date:1201431224657,
        score : 78,
        user_rank: 3

    },
    {   id: 6,
        u_id : 2,
        name : 'Test Name4',
        test_id: 4,
        passed_date:1401818456676,
        score : 82,
        user_rank: 4

    }
],
    User_roles: [
          {
            id: 1,
            role_name: "авторизований користувач"
          },
          {
            id: 2,
            role_name: "модератор"
          },  
          {
            id: 3,
            role_name: "адміністратор"

          }

        ],
    Ranks: [
          {
            id:1,
            name: 'Ступінь 1'
          },
          {
            id:2,
            name: 'Ступінь 2'
          },
          {
            id:3,
            name: 'Ступінь 3'
          },
          {
            id:4,
            name: 'Ступінь 4'
          }
    ], 
    Faqs: [
        {
          id: 0,
          question:'This is question 1',
          answer: 'This is the answer to question #1. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae....'
        },
        {
          id: 1,
          question:'This is question 2',
          answer: 'This is the answer to question #2. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae....'
        },
        {
          id: 2,
          question:'This is question 3',
          answer: 'This is the answer to question #3. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae....'
        },
        {
          id: 3,
          question:'This is question 4',
          answer: 'This is the answer to question #4. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae....'
        },
        {
          id: 4,
          question:'This is question 5',
          answer: 'This is the answer to question #5. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae....'
        }
    ]    
};

function model(date_in){

  if(!localStorage.Application){
    //console.log('loc false');
    localStorage.Application = JSON.stringify(date_in);
  }

  this.save_localStorage = function(){
    localStorage.Application = JSON.stringify(this.date);
  }
  
  this.load_localStorage = function(){
    this.date = JSON.parse(localStorage.Application);
  }
}
var Model = new model(Application);
Model.load_localStorage();

//console.log(Model.date);



/*

var Users = [
{
    id: '0',
        username: 'admin',
        location: 'Ukraine',
        group: 3,
        firstName: 'John',
    lastName: 'Dou',
        org_level: 'початківець',
        password: 'admin',
        email: 'admin@admin.com',
        birthday: '2001-05-10',
    org_troop: 'бурлаки',
    org_region: 'вовчинці',
    org_group: 2,
  login_status: 0
    },
    {
    id: '1',
        username: 'AUser',
        location: 'Ukraine',
        group: 3,
        firstName: 'Петро',
    lastName: 'Петрович',
        org_level: 3,
        password: '1111',
        email: 'admin@admin.com',
        birthday: '1991-05-19',
    org_troop: 'same_value',
    org_region: 'Івано-Франківськ',
    org_group: 2,
  login_status: 0
    }, {
      id: '2',
        username: 'guest',
        location: 'Ukraine',
        group: 3,
        firstName: 'Jake',
    lastName: 'Smith',
        org_level: 2,
        password: 'guest',
        email: 'guest@guest.com',
        birthday: '2008-05-21',
    org_troop: '_same_value',
    org_region: 'same_value',
    org_group: 3,
    org_troop: 'value',
    org_group: 3,
  login_status: 0,
    testScore:[5, 7, 4, 3, 9],
    testPast:['Test Name1','Test Name2','Test Name3','Test Name4','Test Name5',],
    testDate:[]
  
    }


]
*/
/*
question:
  id - унікальний номер запитання в полі question, в межах одного обєкта з масиву Tests
  text - текст самого запитання
answers
  id - унікальний номер відповіді в полі answers, в межах одного обєкта з масиву Tests
  question_id - вказує на запитання, якому належить дана відповід(тобто якшо question_id = 1 то це означає шо ця відповідь відноситься до запитання яке має id=1)
  text_answer - текст самої відповіді
correct_answers
  question_id - вказує  до якого запитання належить
  answer_id - вказує яка відповідь є правильна(тобто якшо question_id = 1 і answer_id = 3 то це означає шо для запитання (question) з id = 1 правильна відповідь буде з (answers) id = 3)

  
  впринципі можна було б обійтися без поля question_id в correct_answers, але так буде лекше  формувати дані... 
  */
  /*
var Tests = [
{
    name: 'Правила дорожнього руху',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657, 1401781659361]
},
{
    name: 'Тест 2',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'Тест 3',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'Тест 4',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'Тест 5',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'Тест 6',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'Тест 7',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
},
{
    name: 'тест 8',
    tags: ['зупинитися', 'тег4', 'тег3', 'тег5', 'тег2'],
    descr: 'Представляємо екзаменаційні білети ДАІ по 20 питань у кожному. Тести з ПДР містять пояснення до правильних відповідей, інтерактивні посилання на відповідні пункти Правил дорожнього руху, можливість задати питання і отримати відповідь, вибір режиму перевірки знань. Пройдеш усі — сміливо здавай екзамен у ДАІ!',
    author: 'John Dou',
    question: [{
        id: 1,
        text: 'Чи мають перевагу сигнали регулювальника перед вимогами дорожніх знаків?'
    }, {
        id: 2,
        text: 'Чи дозволяється керувати автомобілем в темну пору доби або в умовах недостатньої видимості, якщо включені тільки габаритні ліхтарі?'
    }, {
        id: 3,
        text: ' Ви наближаєтеся до нерегульованого пішохідного переходу, перед яким на суміжній з Вами смузі зупинився транспортний засіб. Ви повинні'
    }],
    answers: [{
        id: 1,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 2,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 3,
        question_id: 1,
        text_answer: 'Мають перевагу тільки перед вимогами дорожніх знаків пріоритету і є обовязковими для виконання'
    }, {
        id: 4,
        question_id: 2,
        text_answer: ' Дозволяється на освітленій дорозі у населених пунктах'
    }, {
        id: 5,
        question_id: 2,
        text_answer: 'Дозволяється на освітленій дорозі у населених пунктах.'
    }, {
        id: 6,
        question_id: 2,
        text_answer: 'Дозволяється під час швидкості руху не більше 50 км/год.'
    }, {
        id: 7,
        question_id: 3,
        text_answer: ' Проїхати пішохідний перехід безупинно, але з особливою обережністю.'
    }, {
        id: 8,
        question_id: 3,
        text_answer: 'Проїхати пішохідний перехід беззупинно.'
    }, {
        id: 9,
        question_id: 3,
        text_answer: 'Обовязково зупинитися. При появі пішоходів пропустити їх.'
    }],
    correct_answers: [{
        question_id: 1,
        answer_id: 2
    },{
        question_id: 2,
        answer_id: 3
    },{
        question_id: 3,
        answer_id: 1
    }],
    info: ['info1', 'info2'],
  public: 0,
    subcategory: 4,
    category: 1,
    correct_answers: ['Aenean ut consequat velit'],
    url: 'tests/test1.html',
    date: '1',
    passed_date: [1401211224657, 1401231224657, 1401431224657, 1301431224657, 1201431224657]
}

]
var Categories = [
  {
    id: 1,
    name: "Спорт",
    parent_id: 0
  },
  {
    id: 2,
    name: "туризм",
    parent_id: 0
  },
  {
    id: 3,
    name: "пдр",
    parent_id: 0
  },
  {
    id: 4,
    name: "підкатегорія",
    parent_id:1 
  },
  {
    id: 5,
    name: "підкатегорія",
    parent_id:1 
  },
  {
    id: 6,
    name: "підкатегорія",
    parent_id:1 
  },
  {
    id: 7,
    name: "підкатегорія",
    parent_id:2 
  },
  {
    id: 8,
    name: "підкатегорія",
    parent_id:2
  },
  {
    id: 9,
    name: "підкатегорія",
    parent_id:2 
  },
  {
    id: 10,
    name: "підкатегорія",
    parent_id:3 
  },
  {
    id: 11,
    name: "підкатегорія",
    parent_id:3 
  },
  {
    id: 12,
    name: "підкатегорія",
    parent_id:3 
  } 
  
]
var Result = [
  {
    u_id : 1,
    name : 'Test Name1',
    passed_date: 1391431224657,
    score : 11,
  },
  {
    u_id : 3,
    name : 'Test Name2',
    passed_date: 1381431224657, 
    score : 4,
  },
  {
    u_id : 2,
    name : 'Test Name2',
    passed_date:1499031224657,
    score : 3,
  },
  {
    u_id : 2,
    name : 'Test Name2',
    passed_date:1499031224657,
    score : 1,
  },
  {
    u_id : 4,
    name : 'Test Name6',
    passed_date:1499031224657,
    score : 7,
  },
  {
    u_id : 5,
    name : 'Test Name4',
    passed_date:1499031224657,
    score : 8,
  }
];

var newCategories = [
  {
    id:1,
    name:"Category1",
    type:"Category",
    items:[]
  },

  {
    id:2,
    name:"Category2",
    type:"Category",
    items:[
      {
        id:11,
        name:"SubCategory1",
        type:"SubCategory",
        items:[]
      },
      {
        id:12,
        name:"SubCategory2",
        type:"SubCategory",
        items:[]
      }
    ]
  }
];
*/